In [41]:
import pandas as pd
import numpy as np
import env
import acquire
import os

In [42]:
def get_connection(db, user=env.user, host=env.host, password=env.password):
    '''This function uses credentials from an env file to log into a database'''
    return f'mysql+pymysql://{user}:{password}@{host}/{db}'

In [43]:
def new_zillow_db():
    '''The function uses the get_connection function to connect to a database and retrieve the zillow dataset'''
    return pd.read_sql('''SELECT bedroomcnt, bathroomcnt, calculatedfinishedsquarefeet, taxvaluedollarcnt, 
    yearbuilt, taxamount, fips from properties_2017;''', get_connection('zillow'))

In [45]:
df = new_zillow_db()

In [46]:
def get_zillow_data():
    '''
    This function reads in telco data from Codeup database, writes data to
    a csv file if a local file does not exist, and returns a df.
    '''
    if os.path.isfile('zillow.csv'):
        
        # If csv file exists read in data from csv file.
        df = pd.read_csv('zillow.csv', index_col=0)
        
    else:
        
        # Read fresh data from db into a DataFrame
        df = new_zillow_db()
        
        # Cache data
        df.to_csv('zillow.csv')
        
    return df

In [47]:
df.head()

,bedroomcnt,bathroomcnt,calculatedfinishedsquarefeet,taxvaluedollarcnt,yearbuilt,taxamount,fips
0,0.0,0.0,NaN,9.0,NaN,NaN,6037.0
1,0.0,0.0,NaN,27516.0,NaN,NaN,6037.0
2,0.0,0.0,73026.0,1434941.0,1959.0,20800.37,6037.0
3,0.0,0.0,5068.0,1174475.0,1948.0,14557.57,6037.0
4,0.0,0.0,1776.0,440101.0,1947.0,5725.17,6037.0

In [23]:
#df = df.dropna()

In [24]:
#df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 2901918 entries, 2 to 2982283
Data columns (total 7 columns):
 #   Column                        Dtype
---  ------                        -----
 0   bedroomcnt                    float64
 1   bathroomcnt                   float64
 2   calculatedfinishedsquarefeet  float64
 3   taxvaluedollarcnt             float64
 4   yearbuilt                     float64
 5   taxamount                     float64
 6   fips                          float64
dtypes: float64(7)
memory usage: 177.1 MB

In [28]:
#df.bedroomcnt = df.bedroomcnt.astype(int)

In [31]:
#df.yearbuilt = df.yearbuilt.astype(int)

In [34]:
#df.fips.value_counts()

6037.0    1970806
6059.0     717971
6111.0     213141
Name: fips, dtype: int64

In [35]:
#df.fips = df.fips.astype(int)

In [37]:
#df = df.rename(columns={'bedroomcnt': 'bedrooms', 'bathroomcnt': 'bathrooms', 'calculatedfinishedsquarefeet': 'sqft', 
                        'taxvaluedollarcnt': 'tax_value'})

In [39]:
#df = df.rename(columns={'yearbuilt': 'year', 'taxamount': 'tax_amount'})

In [40]:
#df

         bedrooms  bathrooms     sqft  tax_value  year  tax_amount  fips
2               0        0.0  73026.0  1434941.0  1959    20800.37  6037
3               0        0.0   5068.0  1174475.0  1948    14557.57  6037
4               0        0.0   1776.0   440101.0  1947     5725.17  6037
5               0        0.0   2400.0   287634.0  1943     3661.28  6037
7               0        0.0   3611.0   698984.0  1946     7857.84  6037
...           ...        ...      ...        ...   ...         ...   ...
2982278         3        2.5   1648.0   538640.0  2014     6370.58  6059
2982280         2        1.0    798.0   469300.0  2006     5764.45  6037
2982281         3        3.0   1526.0   594022.0  2014     7343.47  6037
2982282         4        4.0   2110.0   554009.0  2014     6761.20  6037
2982283         1        1.0   1040.0   620284.0  1910     7611.91  6037

[2901918 rows x 7 columns]

In [48]:
def wrangle_zillow():
    '''This function acquires the zillow dataset from the Codeup database using a SQL query and returns a cleaned
    dataframe from a csv file.'''
    # use the get_zillow_data function to acquire the dataset and save it to a csv
    df = get_zillow_data()
    # drop rows with null values
    df = df.dropna()
    # change bedroom count to an integer
    df.bedroomcnt = df.bedroomcnt.astype(int)
    # change year built to an integer
    df.yearbuilt = df.yearbuilt.astype(int)
    # change fips to an integer
    df.fips = df.fips.astype(int)
    # rename columns for readability
    df = df.rename(columns={'bedroomcnt': 'bedrooms', 'bathroomcnt': 'bathrooms', 'calculatedfinishedsquarefeet': 'sqft', 
                        'taxvaluedollarcnt': 'tax_value', 'yearbuilt': 'year', 'taxamount': 'tax_amount'})
    return df

In [49]:
df = wrangle_zillow()

In [50]:
df

         bedrooms  bathrooms     sqft  tax_value  year  tax_amount  fips
2               0        0.0  73026.0  1434941.0  1959    20800.37  6037
3               0        0.0   5068.0  1174475.0  1948    14557.57  6037
4               0        0.0   1776.0   440101.0  1947     5725.17  6037
5               0        0.0   2400.0   287634.0  1943     3661.28  6037
7               0        0.0   3611.0   698984.0  1946     7857.84  6037
...           ...        ...      ...        ...   ...         ...   ...
2982278         3        2.5   1648.0   538640.0  2014     6370.58  6059
2982280         2        1.0    798.0   469300.0  2006     5764.45  6037
2982281         3        3.0   1526.0   594022.0  2014     7343.47  6037
2982282         4        4.0   2110.0   554009.0  2014     6761.20  6037
2982283         1        1.0   1040.0   620284.0  1910     7611.91  6037

[2901918 rows x 7 columns]